In [ ]:
#Merge

In [1]:
import pandas as pd

In [8]:
var1=pd.DataFrame({"A":[1,2,3,4],"B":[11,12,13,14]})
var2=pd.DataFrame({"A":[1,2,3,4],"C":[21,22,23,24]})

pd.merge(var1,var2,on="A")

   A   B   C
0  1  11  21
1  2  12  22
2  3  13  23
3  4  14  24

In [ ]:
#Showing right

In [11]:
var3=pd.DataFrame({"A":[1,2,3,4],"B":[11,12,13,14]})
var4=pd.DataFrame({"A":[1,2,3,5],"C":[21,22,23,24]})
pd.merge(var3,var4,how="right")

   A     B   C
0  1  11.0  21
1  2  12.0  22
2  3  13.0  23
3  5   NaN  24

In [ ]:
#Using indicator

In [13]:
var3=pd.DataFrame({"A":[1,2,3,4],"B":[11,12,13,14]})
var4=pd.DataFrame({"A":[1,2,3,5],"C":[21,22,23,24]})
pd.merge(var3,var4,how="outer",indicator=True)

   A     B     C      _merge
0  1  11.0  21.0        both
1  2  12.0  22.0        both
2  3  13.0  23.0        both
3  4  14.0   NaN   left_only
4  5   NaN  24.0  right_only

In [ ]:
 #Using indexing

In [15]:
var3=pd.DataFrame({"A":[1,2,3,4],"B":[11,12,13,14]})
var4=pd.DataFrame({"A":[1,2,3,5],"B":[21,22,23,24]})
pd.merge(var3,var4,left_index=True,right_index=True)

   A_x  B_x  A_y  B_y
0    1   11    1   21
1    2   12    2   22
2    3   13    3   23
3    4   14    5   24

In [ ]:
#Changing name of index using suffix

In [17]:
var3=pd.DataFrame({"A":[1,2,3,4],"B":[11,12,13,14]})
var4=pd.DataFrame({"A":[1,2,3,5],"B":[21,22,23,24]})
pd.merge(var3,var4,left_index=True,right_index=True,suffixes=("_name","_id"))

   A_name  B_name  A_id  B_id
0       1      11     1    21
1       2      12     2    22
2       3      13     3    23
3       4      14     5    24

In [ ]:
#Concat

In [18]:
sr1=pd.Series([1,2,3,4])
sr2=pd.Series([11,12,13,14])
pd.concat([sr1,sr2])

0     1
1     2
2     3
3     4
0    11
1    12
2    13
3    14
dtype: int64

In [19]:
d1=pd.DataFrame({"A":[1,2,3,4],"B":[11,12,13,14]})
d2=pd.DataFrame({"A":[1,2,3,5],"B":[21,22,23,24]})
pd.concat([d1,d2])

   A   B
0  1  11
1  2  12
2  3  13
3  4  14
0  1  21
1  2  22
2  3  23
3  5  24

In [ ]:
#Using axis

In [21]:
d1=pd.DataFrame({"A":[1,2,3,4],"B":[11,12,13,14]})
d2=pd.DataFrame({"A":[1,2,3,5],"C":[21,22,23,24]})
pd.concat([d1,d2],axis=1)

   A   B  A   C
0  1  11  1  21
1  2  12  2  22
2  3  13  3  23
3  4  14  5  24

In [ ]:
#Removing some values

In [23]:
d1=pd.DataFrame({"A":[1,2,3,4],"B":[11,12,13,14]})
d2=pd.DataFrame({"A":[1,2],"B":[21,22]})
pd.concat([d1,d2],axis=1)

   A   B    A     B
0  1  11  1.0  21.0
1  2  12  2.0  22.0
2  3  13  NaN   NaN
3  4  14  NaN   NaN

In [ ]:
#Using join parameter to remove NaN

In [25]:
d1=pd.DataFrame({"A":[1,2,3,4],"B":[11,12,13,14]})
d2=pd.DataFrame({"A":[1,2],"B":[21,22]})
pd.concat([d1,d2],axis=1,join="inner")

   A   B  A   B
0  1  11  1  21
1  2  12  2  22

In [ ]:
#Using key parameter

In [30]:
d1=pd.DataFrame({"A":[1,2,3,4],"B":[11,12,13,14]})
d2=pd.DataFrame({"A":[1,2,3,4],"C":[21,22,23,24]})
pd.concat([d1,d2],axis=0,keys=["d1","d2"])

      A     B     C
d1 0  1  11.0   NaN
   1  2  12.0   NaN
   2  3  13.0   NaN
   3  4  14.0   NaN
d2 0  1   NaN  21.0
   1  2   NaN  22.0
   2  3   NaN  23.0
   3  4   NaN  24.0

In [ ]:
#Adding two different Dataframes

In [33]:
d1=pd.DataFrame({"D":[1,2,3,4]})
d2=pd.DataFrame({"A":[1,2],"C":[21,22]})
pd.concat([d1,d2])

     D    A     C
0  1.0  NaN   NaN
1  2.0  NaN   NaN
2  3.0  NaN   NaN
3  4.0  NaN   NaN
0  NaN  1.0  21.0
1  NaN  2.0  22.0